print('''1. Coursera (https://www.coursera.org/)

Сайтът предлага онлайн курсове от водещи университети и институции по света. Предлага разнообразни курсове и специализации.

2. edX (https://www.edx.org/) 

Платформа, основана от Harvard и MIT, предлага безплатни курсове от най-добрите университети в света. Обхваща широк спектър от дисциплини.

3. Udemy (https://www.udemy.com/)

Популярен онлайн сайт за курсове, в който преподаватели от целия свят могат да предложат своите знания на студенти.

4. Khan Academy (https://www.khanacademy.org/) 

Безплатна образователна платформа, която предлага уроци по математика, наука, история и други предмети.

5. Codecademy (https://www.codecademy.com/) 

Платформа за онлайн обучение по програмиране, която предлага интерактивни уроци за различни езици и технологии.

6. LinkedIn Learning (https://www.linkedin.com/learning/) 

Платформа за обучение, предлагаща видео уроци по бизнес, технологии и креативни умения.

7. Udacity (https://www.udacity.com/) 

Сайт предлагащ професионални курсове в областта на IT, изкуствен интелект, автономни системи и много други.

8. FutureLearn (https://www.futurelearn.com/) 

Онлайн платформа, предлагаща курсове от водещи университети и организации по света.

9. OpenLearn (http://www.open.edu/openlearn/) 

Безплатни образователни ресурси от Open University, който предлага курсове и обучение по разнообразни теми.

10. Alison (https://alison.com/) 

Безплатна платформа за обучение, предлагаща курсове по бизнес, здравеопазване, технологии и други области.

11. Google Digital Garage (https://learndigital.withgoogle.com/digitalgarage) 

Безплатни курсове и ресурси, предлагани от Google, в области като дигитален маркетинг, данни и технологии.

12. Skillshare (https://www.skillshare.com/) 

Платформа за онлайн обучение, предлагаща курсове в области като дизайн, илюстрация, фотография.

13. ED-Ed (https://ed.ted.com/) 

Образователна платформа, предлагаща ангажиращи анимирани видеа, разработени съвместно с експерти по различни теми.

14. Treehouse (https://teamtreehouse.com/) 

Онлайн платформа за обучение по програмиране, уеб дизайн и мобилно приложение.

15. Stanford Online (https://online.stanford.edu/) 

Безплатни онлайн курсове и професионални сертификати от Станфордския университет.

16. MIT OpenCourseWare (https://ocw.mit.edu/) 

Безплатен достъп до материали от курсове, предлагани от Масачузетския технологичен институт (MIT).

17. Yale Open Courses (https://oyc.yale.edu/)

 Безплатни онлайн курсове, предлагани от Йейлския университет, които покриват разнообразни теми.

18. Carnegie Mellon Open Learning Initiative (https://oli.cmu.edu/) 

Безплатни онлайн курсове, предлагани от Карнеги Мелън, известен с иновации в образованието.

19. Academic Earth (https://academicearth.org/) 

Платформа, предлагаща безплатни онлайн курсове от различни университети по света.

20. Saylor Academy (https://www.saylor.org/) 

Безплатни онлайн курсове и сертификати в различни академични области.

21. Duolingo (https://www.duolingo.com/) 

Популярна и безплатна платформа за обучение на чужди езици, предлагаща игрови упражнения.

22. Tuts+ (https://tutsplus.com/) 

Платформа за онлайн обучение, предлагаща видео уроци и статии по дизайн, кодиране, фотография, илюстрации и други креативни теми.

23. FutureLearn (https://www.futurelearn.com/) 

Онлайн платформа за обучение, предлагаща курсове от водещи университети и организации в различни области.

24. Lingvist (https://www.lingvist.com/) 

Платформа за обучение на чужди езици, която използва адаптивен метод, базиран на вашето ниво и напредък.

25. Busuu (https://www.busuu.com/) 

Онлайн платформа за обучение на чужди езици, предлагаща уроци, тестове и възможност за практика с носители на езика.

26. Google Developers (https://developers.google.com/) 

Обучителни ресурси, предлагани от Google, за разработчици на софтуер.

27. Mozilla Developer Network (https://developer.mozilla.org/) 

Обширни ресурси и ръководства за уеб разработчици, предоставени от Mozilla.

28. W3Schools (https://www.w3schools.com/) 

Популярна платформа за учене на уеб технологии като HTML, CSS, JavaScript и други.

29. FreeCodeCamp (https://www.freecodecamp.org/) 

Безплатна платформа за обучение по програмиране с практически упражнения и проекти.

30. SoloLearn (https://www.sololearn.com/)

 Мобилно приложение за обучение по програмиране с кратки уроци и интерактивни тестове.

31. Harvard CS50 (https://cs50.harvard.edu/) 

Безплатен въведителен курс по компютърни науки, предлаган от Харвардския университет.

32. Scratch (https://scratch.mit.edu/) 

Среда за обучение по програмиране, създадена от MIT, която позволява създаването на интерактивни истории, игри и анимации.

33. DataCamp (https://www.datacamp.com/) 

Платформа за обучение по данни, статистика и машинно обучение, предлагаща интерактивни курсове и проекти.

34. SQLZoo (https://sqlzoo.net/) 

Интерактивни уроци и упражнения по SQL с поддръжка на различни бази данни.

35. LeetCode (https://leetcode.com/) 

Платформа за обучение и подготовка на софтуерни инженери за интервюта с решаване на задачи по програмиране и алгоритми.

36. HackerRank (https://www.hackerrank.com/) 

Сайт предлагащ предизвикателства по програмиране, упражнения и състезания в различни домейни.

37. The Odin Project (https://www.theodinproject.com/) 

Безплатен курс за уеб разработка, който покрива HTML, CSS, JavaScript, Ruby on Rails и други технологии.

38. Scrimba (https://scrimba.com/)

 Платформа за обучение по уеб разработка, предлагаща интерактивни видео уроци.

39. Pluralsight (https://www.pluralsight.com/)

 Платена платформа за обучение с курсове по разработка, IT, киберсигурност, данни и дизайн.

40. Egghead (https://egghead.io/) 

Онлайн платформа, предлагаща курсове и видео уроци за уеб разработчици.

41. Educative (https://www.educative.io/) 

Educative е онлайн платформа за обучение, специализирана в предоставянето на интерактивни курсове по програмиране и разработка на софтуер.

42. Code.org (https://code.org/)

 Организация, насърчаваща обучението по компютърни науки, предлага безплатни уроци и ресурси за учители и ученици.

43. Kadenze (https://www.kadenze.com/) 

Онлайн платформа, предлагаща курсове в области като изкуство, музика, дизайн и технология.

44. Big Data University (https://cognitiveclass.ai/) 

Безплатни онлайн курсове и сертификати по данни, аналитика, машинно обучение и киберсигурност, предлагани от IBM.

45. Dataquest (https://www.dataquest.io/) 

Платформа за обучение по анализ на данни, статистика и машинно обучение, с интерактивни уроци и практически задачи.

46. Python.org (https://docs.python.org/3/tutorial/index.html) 

Официалният Python урок, който предлага въведение в езика и основните концепции на програмиране.

47. RubyMonk (https://rubymonk.com/) 

Интерактивни уроци и задачи за обучение по програмиране с Ruby.

48. Swift Playgrounds (https://www.apple.com/swift/playgrounds/) 

Apple приложение, което предлага интерактивни уроци и игри за обучение на програмиране с Swift.

49. Cplusplus.com (http://www.cplusplus.com/doc/tutorial/) 

Уроци и ресурси за обучение на програмиране с C++.

50. JavaTpoint (https://www.javatpoint.com/) 

Платформа, предлагаща уроци и ресурси за Java, Python, Android, Node.js и други технологии.

51. Learn-C.org (https://www.learn-c.org/) 

Интерактивни уроци за обучение на програмиране с езика C.

52. Blockly Games (https://blockly.games/) 

Забавни и образователни игри, които представят основите на програмирането с блокове.

53. Rosetta Code (http://www.rosettacode.org/) 

Сборник от програмни решения на различни задачи, представени на множество програмни езици.

54. edabit (https://edabit.com/) 

Платформа за обучение по програмиране, предлагаща задачи и предизвикателства с различни степени на сложност.

55. Codepen (https://codepen.io/) 

Социална платформа за разработчици, където можете да тествате и споделяте код за HTML, CSS и JavaScript.

56. Codewars (https://www.codewars.com/)

 Сайт, предлагащ обучение по програмиране

57. Mathigon (https://mathigon.org/) 

Интерактивна платформа за обучение по математика, която предлага ангажиращи и визуални уроци.

58. Brilliant (https://brilliant.org/) 

Платформа за обучение по математика, наука и компютърни науки, предлагаща интерактивни проблеми и курсове.

59. Wolfram Alpha (https://www.wolframalpha.com/) 

Интелигентна система за изчисления и знания, която предоставя решения и отговори на въпроси в различни дисциплини.

60. MathWorld (http://mathworld.wolfram.com/) 

Онлайн енциклопедия за математика, предоставена от Wolfram Research.

61. Art of Problem Solving (https://artofproblemsolving.com/) 

Платформа за математическо обучение, предлагаща курсове, ресурси и форум за математическо общество.

62. Physics Stack Exchange (https://physics.stackexchange.com/) 

Форум, където можете да задавате въпроси и получавате отговори от общността по физика.

63. Chemistry LibreTexts (https://chem.libretexts.org/) 

Безплатни учебници и ресурси по химия, подкрепени от National Science Foundation.

64. Biology Online (https://www.biology-online.org/)

 Енциклопедия и форум за биология, предлагащи статии, ресурси и отговори на въпроси.

65. Geology.com (https://geology.com/) 

Сайт с новини, статии и ресурси по геология и земни науки.

66. Crash Course (https://www.youtube.com/user/crashcourse/) 

YouTube канал, предлагащ кратки образователни видеа по различни теми, включително история, наука и философия.

67. Bozeman Science (https://www.bozemanscience.com/) 

Образователен YouTube канал, предлагащ видеа по биология, химия, физика и други научни дисциплини.

68. Science Channel (https://www.youtube.com/user/ScienceChannel/)

 Официалният YouTube канал на Science Channel, предлагащ документални филми и клипове по различни научни теми.

69. Smarter Every Day (https://www.youtube.com/user/destinws2/) 

YouTube канал, който разглежда науката зад ежедневните явления и интересни факти.

70. Vsauce (https://www.youtube.com/user/Vsauce/) 

Популярен YouTube канал за наука, математика и много други

71. 3Blue1Brown (https://www.youtube.com/channel/UCYO_jab_esuFRV4b17AJtAw)

 YouTube канал, предлагащ визуални обяснения на математически и научни концепции чрез анимации.

72. Veritasium (https://www.youtube.com/user/1veritasium) 

YouTube канал с видеа, които разглеждат научни експерименти, демонстрации и интересни факти.

73. PBS Space Time (https://www.youtube.com/channel/UC7_gcs09iThXybpVgjHZ_7g)

 YouTube канал, предлагащ видеа по астрофизика, космология и свързани научни теми.

74. The Science Asylum (https://www.youtube.com/user/TheScienceAsylum) 

YouTube канал, който разглежда физиката и други научни теми чрез анимации и хумористични примери.

75. MinutePhysics (https://www.youtube.com/user/minutephysics) 

YouTube канал, предлагащ кратки обяснителни видеа на физически концепции и явления.

76. Philosophy Tube (https://www.youtube.com/user/thephilosophytube)

 YouTube канал, предлагащ видеа, които разглеждат различни философски идеи и концепции.

77. School of Life (https://www.youtube.com/theschooloflifetv) 

YouTube канал, който предлага видеа по психология, философия, литература и други области на човешкото знание.

78. Instructables (https://www.instructables.com/) 

Уебсайт, предлагащ стъпка-по-стъпка инструкции за изработване на разнообразни проекти и творби.

79. Make: (https://makezine.com/) 

Платформа, насърчаваща творчеството и изграждането на проекти чрез предлагане на уроци, новини и ресурси.

80. Hackaday (https://hackaday.com/) 

Уебсайт с новини, проекти и туториали за електроника, хардуер и софтуер.

81. Adafruit (https://www.adafruit.com/) 

Онлайн магазин за електронни компоненти, предлагащ обучителни ресурси и уроци за изработване на електронни проекти.

82. SparkFun (https://www.sparkfun.com/) 

Онлайн магазин за електронни компоненти, предлагащ обучителни ресурси и проекти за хобисти и професионалисти.

83. eHow (https://www.ehow.com/) 

Уебсайт със статии и видеоклипове, предлагащ стъпка-по-стъпка инструкции за различни проекти и задачи в ежедневието.

84. Duolingo (https://www.duolingo.com/) 

Популярна платформа за обучение на чужди езици, предлагаща игрови упражнения и уроци.

85. Memrise (https://www.memrise.com/) 

Онлайн платформа за обучение на чужди езици, използваща техники на запомняне чрез асоциации и повторение.

86. FluentU (https://www.fluentu.com/) 

Платформа за езиково обучение, която използва видеоклипове от реалния свят, за да представи езиковите структури и изрази.

87. italki (https://www.italki.com/) 

Сайт за езиково обучение, предлагащ частни уроци с носители на езика и възможност за обмяна на езици с други ученици.

88. Babbel (https://www.babbel.com/) 

Платформа за езиково обучение, която предлага уроци, базирани на практически разговорни ситуации и граматически упражнения.

89. Lingoda (https://www.lingoda.com/) 

Онлайн езикова школа, предлагаща групови и индивидуални уроци по английски, испански, френски и други езици.

90. Mango Languages (https://mangolanguages.com/) 

Платформа за езиково обучение, предлагаща курсове за повече от 70 езика, с акцент върху разговорните умения.

91. Open Culture (https://www.openculture.com/) 

Сайт, предлагащ безплатни образователни ресурси, като аудио курсове, учебници, филми, електронни книги и други.

92. TED-Ed (https://ed.ted.com/) 

Образователна платформа на TED, предлагаща анимирани видеоклипове на различни теми, създадени от експерти в областта.

93. Project Gutenberg (https://www.gutenberg.org/) 

Библиотека с над 60 000 безплатни електронни книги, които могат да се четат на различни устройства.

94. Internet Archive (https://archive.org/)

Огромна колекция от различни материали

95. Librivox (https://librivox.org/) 

Сайт с безплатни аудиокниги, записани от доброволци, предлагащ класическа и съвременна литература на различни езици.

96. Codecademy (https://www.codecademy.com/) 

Платформа за обучение по програмиране, предлагаща интерактивни курсове по различни езици и технологии.

97. FreeCodeCamp (https://www.freecodecamp.org/) 

Безплатна платформа за обучение по програмиране, предлагаща уроци, задачи и проекти по разработка на софтуер и уеб.

98. HackerRank (https://www.hackerrank.com/) 

Сайт, предлагащ кодиращи изпитания и задачи по програмиране, подходящи за подготовка за технически интервюта и обучение.

99. LeetCode (https://leetcode.com/) 

Платформа за обучение и практика на програмиране, предлагаща задачи, изпитания и ресурси за подготовка за интервюта.

100. edX (https://www.edx.org/) 

Онлайн платформа за обучение, предлагаща курсове от водещи университети и институции по широк спектър от дисциплини.''')


